{"_id":"~123011152","createdBy":"admin@lab.local","updatedBy":"admin@lab.local","createdAt":1748887302695,"updatedAt":1748893760441,"_type":"caseTemplate","name":"IRM#19 Third-Party Compromise","displayName":"","titlePrefix":"","description":"Guidelines to handle and respond to a third-party compromise","severity":2,"tags":[],"flag":false,"tlp":2,"pap":2,"tasks":[{"id":"~82141272","_id":"~82141272","createdBy":"admin@lab.local","createdAt":1748893760432,"_type":"case_task","title":"Define Procedures","group":"Preparation","description":"- Establish a process to assess the information system maturity of onboarded service providers via a KYS questionnaire.\n- Establish and maintain Service Level Agreements (SLAs) with third parties, including security and incident response requirements; and specific alerting clauses in case of a compromise of a third-party.\n- Regularly review and assess third-party security controls, policies, and procedures.\n- Establish a formal map of interconnections and communication flows with service providers\n- Implement a “Red Button” to cut off all IT links with the impacted service provider should such a need arise.\n- Assess the feasibility, capacity and time required to block interconnection links with a third party, or third-party accesses; validate with tests and cut off exercises.\n**Make sure to take into account business impact and regulator requirements.**","status":"Waiting","flag":false,"order":1},{"id":"~82145368","_id":"~82145368","createdBy":"admin@lab.local","createdAt":1748893760439,"_type":"case_task","title":"Restore","group":"Recovery","description":"All the following steps shall be made in a step-by-step manner and with technical monitoring.\n- Obtain a formal report from a trusted third party ensuring that the claimant's situation is indeed back to normal.\n- Decide with internally-identified actors whether reopening services, interconnections with the partner is feasible.\n- Work with the affected third party to restore affected services or systems, ensuring that they are secure and free from vulnerabilities.\n- Reevaluate and update the third party's risk profile in light of the incident.\n- Gradually reinstate the third party's access to your organization’s systems, data, and infrastructure, ensuring that appropriate security measures are in place.","status":"Waiting","flag":false,"order":10},{"id":"~123093072","_id":"~123093072","createdBy":"admin@lab.local","createdAt":1748893760433,"_type":"case_task","title":"Monitor Internet Resources","group":"Preparation","description":"- Set up a watch process of ransomware shaming blogs and sites; conduct a comprehensive list of keywords, industry categories or geographies to apply to the desired watch process. Please note that depending on the country, research activities involving leaked data may be subject to compliance with local data regulations including GDPR and the penal code. Please check with your data protection officer, compliance officer or legal advisers prior to setting up the watch process. Conduct an active watch of known threat actors, particularly ransomware operators.\n- Maintain regular monitoring of businesses that experience a cyber attack, especially those compromised by ransomware\n- Automate internal alerting to notify on the presence of a partner on one of the sites of Shaming blogs.\n","status":"Waiting","flag":false,"order":3},{"id":"~123097168","_id":"~123097168","createdBy":"admin@lab.local","createdAt":1748893760437,"_type":"case_task","title":"Use Collected IoCs","group":"Containment","description":"If applicable to the obtained IOCs:\n- Block traffic to C2s.\n- Block any IP detected as used by attackers.\n- Disable accounts compromised/created by attackers.\n- Send the undetected samples to your endpoint security provider and/or private sandboxes.\n- Send the uncategorized malicious URL, domain names and IP to your perimetric security provider.\n\n**If business-critical traffic cannot be disconnected, allow it after putting in place additional security controls to timely detect and inhibit lateral proliferation.**","status":"Waiting","flag":false,"order":8},{"id":"~123171040","_id":"~123171040","createdBy":"admin@lab.local","createdAt":1748893760434,"_type":"case_task","title":"Conduct IR Exercises","group":"Preparation","description":"- Regularly conduct joint incident response exercises with critical third parties.","status":"Waiting","flag":false,"order":4},{"id":"~123183304","_id":"~123183304","createdBy":"admin@lab.local","createdAt":1748893760432,"_type":"case_task","title":"Communication strategies","group":"Preparation","description":"- Prepare internal and external communication strategy in case of an incident including alternative communication channels for applicable contacts.","status":"Waiting","flag":false,"order":2},{"id":"~123187400","_id":"~123187400","createdBy":"admin@lab.local","createdAt":1748893760438,"_type":"case_task","title":"Take actions to limit impact","group":"Remediation","description":"- Reassess the transparency and applicability of the third party's remediation efforts.\n- Consider requesting a formal incident report as applicable to the ongoing incident handling process or forensic investigation, i.e. a letter of commitment signed by the provider’s board or an investigation report by the incident handler / forensic service in charge of the incident.\n- Request an up-to-date list of applicable IOC as reveled by the investigation process.","status":"Waiting","flag":false,"order":9},{"id":"~123301928","_id":"~123301928","createdBy":"admin@lab.local","createdAt":1748893760431,"_type":"case_task","title":"Prepare Contacts","group":"Preparation","description":"**Additional legal requirements are to consider when setting up the monitoring process e.g. https://www.cnil.fr/fr/la-recherche-sur-internet-de-fuites-dinformations-rifi**\n\n\n- Maintain an up-to-date inventory of all third parties, partners, providers and contractors with access to the organization's systems, data, equipment or infrastructure.\n- Prepare and have a readily available contact book of people to involve when contracting third-party services.\n- Define specific 24/7 contact points and people to intervene during non-working hours.","status":"Waiting","flag":false,"order":0},{"id":"~123306024","_id":"~123306024","createdBy":"admin@lab.local","createdAt":1748893760435,"_type":"case_task","title":"Deploy Sandbox facilities","group":"Preparation","description":"- Prepare dedicated facilities for scanning or sandboxing of applicable data and files to use during the incident.","status":"Waiting","flag":false,"order":5},{"id":"~123310120","_id":"~123310120","createdBy":"admin@lab.local","createdAt":1748893760440,"_type":"case_task","title":"Capitalize","group":"Lessons Learned","description":"- Conduct a post-incident review with the affected third party to identify areas for improvement.\n-  Update applicable playbooks or incident management methodologies and other relevant processes based on lessons learned from the incident.\n- Share lessons learned with stakeholders and security community actors to improve overall security posture and incident response capabilities.\n- Keep relevant stakeholders within your organization informed throughout the incident response process, including senior management and the legal department.\n- Make sure the incident has been properly documented, including timeline, impact, and response measures, for compliance and audit purposes.\n- In coordination with the legal and public relations departments, prepare and release appropriate communications to external parties - if needed.","status":"Waiting","flag":false,"order":12},{"id":"~164118560","_id":"~164118560","createdBy":"admin@lab.local","createdAt":1748893760436,"_type":"case_task","title":"Activate a Specific Crisis Management Cell (for sensitive resources access)","group":"Containment","description":"If the incident involves access to organization’s sensitive resources, a specific crisis management cell may be summoned.\n- Temporarily suspend or restrict the affected third party's access to the organization’s systems, data, equipment or infrastructure, as necessary.\n- Limit communication by email completely or selectively (i.e. by redirecting provided emails to a dedicated sandboxed environment or mailbox, by stripping attachments, links, or other content).\n- Set up regular meetings with the affected provider, onboarding applicable stakeholders.\n- Coordinate with the affected third party to implement containment measures, such as isolating compromised systems, blocking malicious IoCs, or changing credentials.","status":"Waiting","flag":false,"order":7},{"id":"~205103104","_id":"~205103104","createdBy":"admin@lab.local","createdAt":1748893760436,"_type":"case_task","title":"Detection","group":"Identification","description":"**You may need to notify stakeholders, partners and regulators at the beginning of this step if required.**\n\n\n\n\n\n- Use proactive monitoring stemming from shaming blogs’ watch, open sources or private notification: regularly check and analyze all applicable threat intelligence feeds for early detection of information on potential third-party compromises.\n- Continuously monitor ingress / egress network flows to timely detect anomalies in interconnections with third-parties.\n- Involve all previously identified stakeholders (Business, Purchasing, Legal, Infrastructure, Information Security, etc.); evaluate potential impact based on available information on the incident and feedback from the business and the IT.\n- Evaluate possible remediation scenarios: blocking interconnections, reinforcing monitoring based on the risk assessment vs. potential impacts on production.\n- Communicate/escalate the incident to higher levels in your organization (up to the Board) to have the most complete and comprehensive vision of the situation.\n- Establish communication channels with the impacted third-party to share information about the ongoing incident. If required by the incident’s nature, set up dedicated alternative (non-corporate) channels to use for communication and data exchange during the incident.\n- Evaluate the level of provider’s trustworthiness according to the level of transparency that can be established with the third party, perception of the quality of its communication and the effective delivery of applicable investigation and incident handling reports, IoC, etc.\n\n**Additional due care recommendations: in case of signs of lateralization, please refer to IRM 18 – Large Scale Compromise.**","status":"Waiting","flag":false,"order":6},{"id":"~205107200","_id":"~205107200","createdBy":"admin@lab.local","createdAt":1748893760439,"_type":"case_task","title":"Report","group":"Lessons Learned","description":"An incident report should be written and made available to all the stakeholders.\n\nThe following themes should be described:\n- Initial cause of the infection\n- Actions and timelines of every important event\n- What went right\n- What went wrong\n- Incident cost\n- Indicators of Compromise","status":"Waiting","flag":false,"order":11}],"status":"Ok","customFields":{},"metrics":{}}