{"_id":"~421944","createdBy":"admin@lab.local","updatedBy":"admin@lab.local","createdAt":1734970148955,"updatedAt":1748893674115,"_type":"caseTemplate","name":"IRM#6 Website defacement","displayName":"","titlePrefix":"","description":"Live reaction on a compromised web server","severity":3,"tags":["veris:attribute:integrity:variety=\"Defacement\"","veris:action:social:vector=\"Website\""],"flag":false,"tlp":2,"pap":2,"tasks":[{"id":"~41189528","_id":"~41189528","createdBy":"admin@lab.local","createdAt":1748893674104,"_type":"case_task","title":"Preparation","group":"Preparation","description":"- Have up-to-date schemes describing your applicative components related to the web server.\n- Make sure you have an up-to-date network map.\n- Build a backup website up-and-ready, on which you can publish content.\n- Define a procedure to redirect every visitor to this backup website (a static maintenance page for example).\n- Deploy monitoring and intrusion prevention tools (`WAF`, `fail2ban` and the likes) to detect and prevent any abnormal activities targeting your critical webservers.\n- Export the web server’s log files to an external server. Make sure clocks are synchronized between each server.\n- Deploy attack and vulnerability exploitation detection rules based on the server's logs and monitor them.\n- Audit your webservices before the release and on regular basis (monthly if possible).\n- Reference all sources of external static or dynamic contents; create a list for each of them. **Don’t forget third parties for advertisement**.\n- Reference contact points of your hosting provider.\n- Be sure your hosting provider enforces policies to log all events and verify your contractual compliance.\n- Prepare communication templates in case the incident is visible for users and needs to be explained.","status":"Waiting","flag":false,"order":0},{"id":"~41193624","_id":"~41193624","createdBy":"admin@lab.local","createdAt":1748893674107,"_type":"case_task","title":"Mitigate the attack’s effects","group":"Containment","description":"- **Backup all data** stored on the web server for forensic purposes and evidence collection. The best practice here if applicable is to make a complete bit-by-bit copy of the hard-disk containing the web server. This will be helpful to recover deleted files.\n\n- **Check your network architecture map. Verify that the vulnerability exploited by the attacker is not located somewhere else** :\n  - Check the system on which the web server is running,\n  - Check other services running on that machine,\n  - Check the connections to other systems, which might be compromised.\n\n**If the source of the attack is another system on the network, disconnect it if possible physically and investigate the culprit machine.**","status":"Waiting","flag":false,"order":3},{"id":"~41197720","_id":"~41197720","createdBy":"admin@lab.local","createdAt":1748893674110,"_type":"case_task","title":"Change all user passwords","group":"Recovery","description":"- **Change all user passwords**, if the web server provides user-authentication, and you have evidence/reasons to believe the passwords may have been compromised. This can require a large user communication campaign.","status":"Waiting","flag":false,"order":6},{"id":"~82104496","_id":"~82104496","createdBy":"admin@lab.local","createdAt":1748893674106,"_type":"case_task","title":"Verify the defacement and detect its origin:","group":"Identification","description":"- Check files with static content (in particular, check the modification dates, hash signature).\n- Checkmashupcontentproviders.\n- Check link presents in the web page (src, meta, css, script, ...).\n- Checklogfiles.\n- Scan the databases for malicious content.\n\n**The source code of the suspicious page must be analysed carefully to identify and scope-up the problem**\n\n** In particular, be sure the problem originated from a web server belonging to the company and not from the web content located outside your infrastructure, such as in ad banners from a third party.**","status":"Waiting","flag":false,"order":2},{"id":"~123076688","_id":"~123076688","createdBy":"admin@lab.local","createdAt":1748893674114,"_type":"case_task","title":"Capitalize","group":"Lessons Learned","description":"Actions to improve the handling of the defacement incidents should be defined to capitize on this experience.","status":"Waiting","flag":false,"order":11},{"id":"~123154632","_id":"~123154632","createdBy":"admin@lab.local","createdAt":1748893674105,"_type":"case_task","title":"Usual channels of detection","group":"Identification","description":"Usual channel of detection are:\n\n- Webpage monitoring: The content of a web page has been altered. The new content is either very discreet( an \"iframe\" injection for example_ or explicit (\"You have been hacked by XXX\").\n- Users: you receive calls from users or notifications from employees about problems they notice while browsing the website.\n- Security checks with tools such as Google SafeBrowsing.","status":"Waiting","flag":false,"order":1},{"id":"~123232296","_id":"~123232296","createdBy":"admin@lab.local","createdAt":1748893674110,"_type":"case_task","title":"Restore primary web server if backup server has been used","group":"Recovery","description":"- If backup server has been used, restore the primary web server component as nominal","status":"Waiting","flag":false,"order":7},{"id":"~123236392","_id":"~123236392","createdBy":"admin@lab.local","createdAt":1748893674111,"_type":"case_task","title":"Monitor logs","group":"Recovery","description":"- MOnitor logs and alerts closely to detect new attacks.","status":"Waiting","flag":false,"order":8},{"id":"~123240488","_id":"~123240488","createdBy":"admin@lab.local","createdAt":1748893674113,"_type":"case_task","title":"Report","group":"Lessons Learned","description":"A crisis report should be written and made available to all of the involved parties.\n\nThe following themes should be described: \n- Initial detection;\n- Actions and timelines;\n- What went right;\n- What went wrong; \n- Incident cost\n- Indicators of Compromise\n\nShould a vulnerability be identified, report any undocumented flaw impacting to the application's editor, so that the code can be reviewed and receive on official fix.\n","status":"Waiting","flag":false,"order":10},{"id":"~205070336","_id":"~205070336","createdBy":"admin@lab.local","createdAt":1748893674108,"_type":"case_task","title":"Find all the evidences","group":"Containment","description":"- Try to find evidences of **every** action perpetrated by the attacker\n- Find out how the attacker got into the system in the first place and fix the root cases:\n  - a Web component vulnerability allowing write access:\n    - fix the vulnerability by applying editor’s fix.\n  - **CMS plugin vulnerabilities** are often exploited by attackers and need to identified and patched;\n  - An **Open public folder**: make it private\n  - A SQL weakness allowing injection: correct the code.\n  - A Mashup components: cut off implicated mashup feeds.\n  - An **administrative modification by physical access**: modify the access rights.\n\n**If required (complex issue and very important web server), deploy a temporary web server**, up to date with its applications. The server should offer the same content than that one of the compromised machine or at least display legitimate content such as “Temporary unavailable” or any other static maintenance page. The best is to display a temporary static content, containing only HTML code. This prevents another infection in case the attacker has used vulnerability in the legitimate PHP/ASP/CGI/PL/etc. code.","status":"Waiting","flag":false,"order":4},{"id":"~205074432","_id":"~205074432","createdBy":"admin@lab.local","createdAt":1748893674109,"_type":"case_task","title":"Remove all altered content","group":"Remediation","description":"- Remove all altered content and replace it with the legitimate content, restored from earlier backup.\n- Make sure this content is free from vulnerabilities; patch if necessary.","status":"Waiting","flag":false,"order":5},{"id":"~205078528","_id":"~205078528","createdBy":"admin@lab.local","createdAt":1748893674112,"_type":"case_task","title":"Communication","group":"Lesson Learned","description":"If the defacement has become public, consider preparing and sending out a dedicated communication message explaining the incident.","status":"Waiting","flag":false,"order":9}],"status":"Ok","customFields":{},"metrics":{}}