{"_id":"~41332880","createdBy":"admin@lab.local","updatedBy":"admin@lab.local","createdAt":1734970117095,"updatedAt":1748893778169,"_type":"caseTemplate","name":"IRM#17 Ransomware","displayName":"","titlePrefix":"","description":"Guidelines to handle and respond to ransomware infection","severity":4,"tags":[],"flag":false,"tlp":2,"pap":2,"tasks":[{"id":"~41214104","_id":"~41214104","createdBy":"admin@lab.local","createdAt":1748893778157,"_type":"case_task","title":"Log retention","group":"Preparation","description":"Have a good log retention and verbosity","status":"Waiting","flag":false,"order":4},{"id":"~41218200","_id":"~41218200","createdBy":"admin@lab.local","createdAt":1748893778163,"_type":"case_task","title":"Host based identification","group":"Identification","description":"- Look for unusual executable binaries in users’ profiles (`%ALLUSERSPROFILE%` or `%APPDATA%`) and `%SystemDrive%`\n- Look for the aforementioned extensions or ransom notes\n- Capture a memory image of the computer (if possible)\n- Look for unusual processes\n- Look for unusual email attachment patterns\n- Look for unusual network or web browsing activities; especially connections to Tor or I2P IP, Tor gateways (tor2web, etc) or Bitcoin payment websites","status":"Waiting","flag":false,"order":11},{"id":"~82129072","_id":"~82129072","createdBy":"admin@lab.local","createdAt":1748893778156,"_type":"case_task","title":"Use Threat Intelligence","group":"Preparation","description":"**Block IoCs linked to ransomware activities gathered by Threat Intelligence.**","status":"Waiting","flag":false,"order":3},{"id":"~82133168","_id":"~82133168","createdBy":"admin@lab.local","createdAt":1748893778167,"_type":"case_task","title":"Report","group":"Lessons Learned","description":"An incident report should be written and made available to all of the stakeholders.\n\nThe following themes should be described:\n- Initial detection.\n- Actions and timelines.\n- What went right.\n- What went wrong.\n- Incident cost\n- Indicators of Compromise.","status":"Waiting","flag":false,"order":16},{"id":"~82153560","_id":"~82153560","createdBy":"admin@lab.local","createdAt":1748893778159,"_type":"case_task","title":"Define  posture versus attacker","group":"Preparation","description":"Define a strict posture versus the attacker","status":"Waiting","flag":false,"order":6},{"id":"~82157656","_id":"~82157656","createdBy":"admin@lab.local","createdAt":1748893778162,"_type":"case_task","title":"General signs of ransomware","group":"Identification","description":"**Several leads might hint that the system could be compromised by ransomware:**\n- Monitoring of ransomware IoCs by a SOC.\n- Supervisions of EDR alerts.\n- Odd professional emails (often masquerading as invoices) containing attachments are being received\n- A ransom message explaining that the documents have been encrypted and asking for money is displayed on user’s desktop\n- People are complaining about their files not being available or corrupted on their computers or their network shares with unusual extensions (`.abc`, `.xyz`, `.aaa`, etc..).\n- Numerous files are being modified in a very short period of time on the network shares\n- Lateral movement is usually done, check all connection to the AD and Sharefile server with priviledged accounts at abnormal day time.\n- Look for unusual network or web browsing activities; especially connections to Tow I2P IP, Tor gateways (tor2web, etc ...) or Bitcoin payment websites.\n- Look for rare connections.","status":"Waiting","flag":false,"order":9},{"id":"~82161752","_id":"~82161752","createdBy":"admin@lab.local","createdAt":1748893778164,"_type":"case_task","title":"Network based identification","group":"Identification","description":"- Look for connection patterns to Exploit Kits\n- Look for connection patterns to ransomware C&C\n- Look for unusual network or web browsing activities; especially connections to Tor or I2P IP, Tor gateways (tor2web, etc) or Bitcoin payment websites\n- Look for unusual email attachment patterns","status":"Waiting","flag":false,"order":12},{"id":"~82165848","_id":"~82165848","createdBy":"admin@lab.local","createdAt":1748893778166,"_type":"case_task","title":"Restore the system to normal operations","group":"Recovery","description":"1. Update antivirus signatures for idenfied malicious binaries to be blocked.\n1. Ensure that no malicious binaries are present on the system before reconnecting them.\n1. Ensure that the network traffic is back to normal.\n1. Restore user's documents from backups.\n\nPrioritize your recovery plan based on your DRP (**disaster recovery plan**)\n\n\n**All of these steps shall be made in a step-by-step manner and with technical monitoring.**\n\n- Verify that backups are not compromised: only restore from a backup if you are very confident that the backup and the device you are connecting it to are clean:\n**OR**\n- Reimage the computer with a clean install.\n- Reset credentials including passwords (especially for administrator and other system accounts).\n\n**Monitor network traffic to identify if any infection remains.**\n\n**If possible, aply geo-filtering on firewall to block foreign country traffic.**\n\n**Maintain the monitoring ransomware threat actor websites and Internet to find if there is any data leak pubblication related to the ransomware compromise.**\n\n","status":"Waiting","flag":false,"order":15},{"id":"~123101264","_id":"~123101264","createdBy":"admin@lab.local","createdAt":1748893778155,"_type":"case_task","title":"Deploy EDR (if possible)","group":"Preparation","description":"Deploy an EDR solution on endpoints and servers\n\n- This tool became one of the cornerstones of the incident response in case of ransomware or in large scale compromise, facilitating identification, containment and remediation phases.\n- Launch EDR Search and AV sca nwith IoC explicit rules and get first indicators for remediation progress following.\n- Set your EDR policies in prevent mode.","status":"Waiting","flag":false,"order":1},{"id":"~123105360","_id":"~123105360","createdBy":"admin@lab.local","createdAt":1748893778160,"_type":"case_task","title":"Prepare Communication Strategy","group":"Preparation","description":"Prepare and internal and an external communication strategy.","status":"Waiting","flag":false,"order":7},{"id":"~123109456","_id":"~123109456","createdBy":"admin@lab.local","createdAt":1748893778164,"_type":"case_task","title":"Containment","group":"Containment","description":"- Make a public statement as soon as possible based on the communication template elaborated in the preparation phase\n- Follow the posture defined in the preparation phase.\n- Send the undetected samples to your endpoint security provider and/or private sandboxes\n- Send the uncategorized malicious URL, domain names and IP to your perimetric security provider\n- Block traffic to identified ransomware’s C&C\n- Block and IP detected as used by attackers.\n- Isolate compromised VLAN, interconnection, entities, regions, partners or Internet.\n- Disable accounts compromised/created by attackers.\n- Disconnect all computers that have been detected as compromised from the network\n  - you could isolate with our EDR and shut down internet just keeping your EDR connections up.\n- If you cannot isolate the computer, disconnect/cancel the shared\n```\nNET USE x: \\\\unc\\path\\ /DELETE\n```\n\n**Monitor ransomware threat actor websites and Internet to find if there is any dataleak publication related to the ransomware compromise.**\n","status":"Waiting","flag":false,"order":13},{"id":"~123175136","_id":"~123175136","createdBy":"admin@lab.local","createdAt":1748893778154,"_type":"case_task","title":"Preparation","group":"Preparation","description":"- A good knowledge of the usual operating systems security policies is needed.\n- A good knowledge of the usual users’ profile policies is needed.\n- A good knowledge of Architecture, VLAN segmentation and inter-connections\n\n** Ensure that the endpoint and perimetric (email gateway, proxy caches) security products are up to date**","status":"Waiting","flag":false,"order":0},{"id":"~123179232","_id":"~123179232","createdBy":"admin@lab.local","createdAt":1748893778158,"_type":"case_task","title":"Deploy security solution","group":"Preparation","description":"Deploy and operate security solution enabling detection and facilitating response:\n- Log gathering in a SIEM\n- Have the capacity to run tools like YARA or DFIR-ORC (ANSSI)","status":"Waiting","flag":false,"order":5},{"id":"~123191496","_id":"~123191496","createdBy":"admin@lab.local","createdAt":1748893778162,"_type":"case_task","title":"Scoping of the Incident","group":"Identification","description":"- EDR or large-scale hunting tools like YARA or DFIR-ORC allows to make the scoping of the ransomware infected machines.\n- The identification of the initial access and the pivot used by the attackers is the priority, as in Large scale malware compromise. This allows to establish the following phases actions.\n\n**The identification of the Threat Actor at the origin of the ransomware attack could help the following phases based on known TTPs.**\n\n**_Ransomware net compromise identification have many similarities with Large scale malware compromise. Most of the time, raction decision must be taken faster in ransomware cases. For more details about Large scale malware compromise, please refer to IRM-18._ **","status":"Waiting","flag":false,"order":10},{"id":"~123314216","_id":"~123314216","createdBy":"admin@lab.local","createdAt":1748893778155,"_type":"case_task","title":"Raise user awareness","group":"Preparation","description":"**Since this threat is often detected by end-users, raise your IT support awareness regarding the ransomware threat**","status":"Waiting","flag":false,"order":2},{"id":"~123318312","_id":"~123318312","createdBy":"admin@lab.local","createdAt":1748893778165,"_type":"case_task","title":"Remediation","group":"Remediation","description":"- Remove the initial access used by the attacker, e.g.\n  - Remove the binaries and the related registry entries (if any) from compromised profiles (`%ALLUSERSPROFILE%` or `%APPDATA%`) and `%SystemDrive%`\n- Remove binaries used by the attacker to lateralize on the network\n- Remove any accounts created by attackers.\n- Go back configuration changes. \n- Operate a systems and network configuration hardening.\n\n\n**If the above steps are not possible re-image the computer with a clean install**","status":"Waiting","flag":false,"order":14},{"id":"~123322408","_id":"~123322408","createdBy":"admin@lab.local","createdAt":1748893778168,"_type":"case_task","title":"Capitalize","group":"Lessons Learned","description":"Actions to improve malware and network intrusion detection processes should be defined to capitalize on this experience.","status":"Waiting","flag":false,"order":17},{"id":"~205111296","_id":"~205111296","createdBy":"admin@lab.local","createdAt":1748893778161,"_type":"case_task","title":"Backup Preparation","group":"Preparation","description":"Make sure to have exhaustive, recent and reliable backups of local and network users' data.\n\nYou can follow the **3-2-1 backup rules**: each of these rules is meant to make sure that your data is store in multiple ways.\n\nSo, if you're backing something up, you would have:\n* **At least three copies**: meaning three different copies in different places. By keeping them on different places, it reduces risk of a single event destroying multiple copies.\n\n* In **two different formats**: this means that you must use at least two different methods to store your data. For example, DVD, Hard drives, Cloud Services are different formats. But if you store tow copies into two hard drives, here you will just use one format.\n\n* with **one of those copies off-site**: keeping one copy off-site ensures that even whatever happen where your data is (fire, break-in, natural disaster...) at least one copy is safe somewhere else. In this rule, cloud services make sense.\n\n\n** Try to use one backup format stored out of your network: even lateral movement happens from thre threat that harm your network encryption one copy will ne out of reach**","status":"Waiting","flag":false,"order":8}],"status":"Ok","customFields":{},"metrics":{}}