{"_id":"~41218128","createdBy":"admin@lab.local","updatedBy":"admin@lab.local","createdAt":1734970077776,"updatedAt":1748895256897,"_type":"caseTemplate","name":"IRM#10 Social Engineering","displayName":"","titlePrefix":"","description":"How to handle a social engineering incident (phone or e-mail)","severity":3,"tags":[],"flag":false,"tlp":2,"pap":2,"tasks":[{"id":"~82145456","_id":"~82145456","createdBy":"admin@lab.local","createdAt":1748895256889,"_type":"case_task","title":"Prepare to track the attacker","group":"Preparation","description":"Prepare to handle conversation with social engineers to identify which information could help tracking the attacker and his goals.\n\nCheck your legal department to see which actions are allowed and which reactions they can handle.","status":"Waiting","flag":false,"order":0},{"id":"~82190424","_id":"~82190424","createdBy":"admin@lab.local","createdAt":1748895256890,"_type":"case_task","title":"Raise User Awareness","group":"Preparation","description":"- Raise user awareness and security policies\n\n\n**Never give any personal or corporate information to an\nunidentified person. This could include user IDs, passwords, account information, name, e-mail address, phone (mobile or landline) numbers, address, social security number, job titles, information on clients, organization or IT systems.**\n\n**The goal of the social engineer is to steal human resources,\ncorporate secrets or customer/user data.**","status":"Waiting","flag":false,"order":1},{"id":"~82194520","_id":"~82194520","createdBy":"admin@lab.local","createdAt":1748895256895,"_type":"case_task","title":"Report","group":"Lessons Learned","description":"Inform your hierarchy and subsidiaries about the incident, this could help to avoid similar attacks later.\n\nAn incident report should be written and made available to all the actors of the incident.\n\nThe following themes should be described:\n- Initial detection\n- Actions and timelines\n- What went right\n- What went wrong\n- Incident cost (direct and indirect losses)\n- Indicators of Compromise","status":"Waiting","flag":false,"order":8},{"id":"~123146320","_id":"~123146320","createdBy":"admin@lab.local","createdAt":1748895256891,"_type":"case_task","title":"Detect","group":"Identification","description":"- Phone call / someone you don't know calls you/your service, asking for detailed information.\n  - If the contact works out of the company and requests for information that could be valuable for a competitor, deny his requests and go to part 3.\n  - If the contact pretends to be an employee of your company but the phone number is hidden or not internal, propose that you call back to the declared number in the directory. If the supposedly\nattacker agrees, call back to check. If he rejects this option, go to part 3.\n\n**The attacker might use several techniques to entice his victim to speak (fear, curiosity, empathy ...). Do not disclose information in any case.**\n**Listen carefully to his requests and at the end ask for a phone number to call back or an email address to reply.**\n**Take notes and stay calm, even if the attacker is shouting or threatening, remember he tries to use human weaknesses.**\n\nIf you can go further, the following information will be precious:\n- the name of the correspondent\n- requested information / people\n- accent, language skills\n- industry language and organizational knowledge\n- background noises\n- time and duration of the call\n- E-mail / Someone you don't know requests detailed information:\n  - If the contact has an “out of the company” e-mail address and requests information that could be valuable for a competitor, go to part 3.\n  - If the contact uses an internal e-mail address but is asking for weird information, ask him some explanations and use the company directory to get his manager's name that you'll place as a copy.\n- Eventually notify top management to inform them that an incident has been encountered relating to a social engineering attack. They might understand the goals depending on the context.","status":"Waiting","flag":false,"order":3},{"id":"~123150416","_id":"~123150416","createdBy":"admin@lab.local","createdAt":1748895256892,"_type":"case_task","title":"Actions for CERT or incident response team","group":"Containment","description":"Phonecall:\n- Resume the conversation with the attacker and use one of these techniques:\n- Impersonate the identity of the people whom the attacker is willing to speak\n- Slow down and make last the conversation and entice the attacker to make mistake.\n- Explain him that social engineering attack is forbidden by law, punished by sanctions and that lawyer team will handle the issue if it continues\n\n_If the trap phone number has been used, prepare to “burn it”, create another one and display it in the directory._\n\nE-mail:\n- Collect as much information as possible on the email address:\n- Analyze the email headers and try to locate the source\n- Search the e-mail address with Internet tools\n- Geolocalize the user behind the email address\n- Aggregate all social engineering attacks to visualize the scheme.","status":"Waiting","flag":false,"order":4},{"id":"~123154512","_id":"~123154512","createdBy":"admin@lab.local","createdAt":1748895256894,"_type":"case_task","title":"Remediation","group":"Remediation","description":"Some possible remediation actions can be tried:\n- Alert the law enforcement and/or file a complaint\n- Discuss the problem in circles of trust to know if the company is facing this issue alone,\n- Threaten the attacker with legal actions if he can be identified","status":"Waiting","flag":false,"order":6},{"id":"~123207880","_id":"~123207880","createdBy":"admin@lab.local","createdAt":1748895256891,"_type":"case_task","title":"Report suspicious event to your manager","group":"Preparation","description":"**Report any suspicious event to your manager, who will forward it to the CISO in order to have a centralized reporting.**\n\n- Have a defined process to redirect any “weird” request to a “red” phone, if needed.\n- Prepare to handle conversation with social engineers to identify which information could help tracking the attacker and his goals.\n- Check your legal department to see which actions are allowed and which reactions they can handle.","status":"Waiting","flag":false,"order":2},{"id":"~123367464","_id":"~123367464","createdBy":"admin@lab.local","createdAt":1748895256893,"_type":"case_task","title":"Actions for all employees","group":"Containment","description":"**At this step, you should be pretty sure that you're dealing with a social engineering attack.**\n\nActions for all employees:\n\nPhone call\n- If the attacker urges you to give a phone number, follow these steps:\n- Use the “red phone line” from your CERT/CSIRT, if existing.\n- Give him the number with an invented name.\n- Immediately call your CERT/CSIRT team explaining what happened and the chosen invented name.\n- If the attacker stresses you too much and does not let you time to find the Red Phone number, ask him to call you back later, pretending a meeting.\n\nIf the attacker wants to reach someone, follow these points :\n- Place on hold the attacker and call CERT/CSIRT team and explain what happened.\n- Transfer the conversation of the attacker to CERT/CSIRT team (do not give him the number).\n\nE-mail\n- Forward to your security team all email including headers (send as attached documents) for investigation purposes. It might help to track the attacker.","status":"Waiting","flag":false,"order":5},{"id":"~123371560","_id":"~123371560","createdBy":"admin@lab.local","createdAt":1748895256896,"_type":"case_task","title":"Capitalize","group":"Lessons Learned","description":"Inform your hierarchy and subsidiaries about the incident, this could help to avoid similar attacks later.\n\nActions to improve the social engineering handling processes should be defined to capitalize on this experience, specially awareness.","status":"Waiting","flag":false,"order":9},{"id":"~164163616","_id":"~164163616","createdBy":"admin@lab.local","createdAt":1748895256895,"_type":"case_task","title":"Restore system","group":"Recovery","description":"Notify the top management of the actions and the decisions taken on the social engineering case.","status":"Waiting","flag":false,"order":7}],"status":"Ok","customFields":{},"metrics":{}}