{"_id":"~413720","createdBy":"admin@lab.local","updatedBy":"admin@lab.local","createdAt":1734970131827,"updatedAt":1748893658236,"_type":"caseTemplate","name":"IRM#4 DDOS","displayName":"","titlePrefix":"","description":"Guidelines to handle Distributed Denial of Service incidents","severity":2,"tags":["veris:action:hacking:variety=\"DoS\""],"flag":false,"tlp":2,"pap":2,"tasks":[{"id":"~41173144","_id":"~41173144","createdBy":"admin@lab.local","createdAt":1748893658226,"_type":"case_task","title":"Network Infrastructure","group":"Preparation","description":"- Design a good network infrastructure without Single Point of Failure or bottleneck.\n- Deploy a Web Application Firewall to protect against application layer DDoS.\n- Distribute your DNS servers and other critical services (SMTP, etc) through different AS.\n- Harden the configuration of network, OS, and application components that may be targeted by DDoS.\n- Baseline your current infrastructure’s performance, so you can identify the attack faster and more accurately.\n- If your business is Internet dependent, consider purchasing specialized DDoS mitigation products or services.\n- Confirm DNS time-to-live (TTL) settings for the systems that might be attacked. Lower the TTLs, if necessary, to facilitate DNS redirection if the original IP addresses get attacked. **600 is a good TTL value.**\n- Depending of the criticality of your services, consider setting-up a backup that you can switch on in case of issue.","status":"Waiting","flag":false,"order":2},{"id":"~41177240","_id":"~41177240","createdBy":"admin@lab.local","createdAt":1748893658228,"_type":"case_task","title":"Analyze the attack","group":"Identification","description":"- Keep in mind the DDoS attack could be a smokescreen hiding a more sophisticated and targeted attack.\n- Check your anti-DDoS service analysis and you scrubbing centre reports.\n  - Understand the logical flow of the DDoS attack and identify the infrastructure components affected by it.\n  - Understand if you are the target of the attack or a collateral victim\n- Review the load and log files of servers, routers, firewalls, applications, and other affected infrastructure\n- Identify what aspects of the DDoS traffic differentiate it from benign traffic\n  - Source IP addresses, AS, etc\n  - Destination ports\n  - URLs\n  - Protocols flags\n\n\nNetwork analysis tools can be used to review the traffic:\n`Tcpdump`, `Tshark`, `Snort`, `Argus`, `Ntop`, `Aguri`, `MRTG`, `Cacti`, `Nagios`\n\nIf possible, create a NIDS signature to focus to differentiate between benign and malicious traffic.","status":"Waiting","flag":false,"order":5},{"id":"~41181336","_id":"~41181336","createdBy":"admin@lab.local","createdAt":1748893658232,"_type":"case_task","title":"Assess the end of the DDoS condition","group":"Recovery","description":"- Ensure that the impacted services are reachable again.\n- Ensure that your infrastructure performance is back to your baseline performance.","status":"Waiting","flag":false,"order":10},{"id":"~41185432","_id":"~41185432","createdBy":"admin@lab.local","createdAt":1748893658233,"_type":"case_task","title":"Rollback the mitigation measures","group":"Recovery","description":"- Switch back traffic to your original network. \n- Restart stopped services.\n\n**Ensure that the recovery-related actions are decided in accordance with the network teams. Bringing up services could have unexpected side effects.**","status":"Waiting","flag":false,"order":11},{"id":"~82120792","_id":"~82120792","createdBy":"admin@lab.local","createdAt":1748893658235,"_type":"case_task","title":"Capitalize","group":"Lessons Learned","description":"- Consider what preparation steps you could have taken to respond to the incident faster or more effectively.\n- If necessary, adjust assumptions that affected the decisions made during DDoS incident preparation.\n- Assess the effectiveness of your DDoS response process, involving people and communications.\n- Consider what relationships inside and outside your organizations could help you with future incidents.\n- Collaborate with legal teams if a legal action is in process.","status":"Waiting","flag":false,"order":13},{"id":"~123150560","_id":"~123150560","createdBy":"admin@lab.local","createdAt":1748893658227,"_type":"case_task","title":"Internal contacts","group":"Preparation","description":"- Establish contacts for your IDS, firewall, systems, and network teams.\n- Collaborate with the business lines to understand business implications (e.g., money loss) of likely DDoS attack scenarios.\n- Involve your BCP/DR planning team on DDoS incidents.\n","status":"Waiting","flag":false,"order":3},{"id":"~123154656","_id":"~123154656","createdBy":"admin@lab.local","createdAt":1748893658230,"_type":"case_task","title":"Check the background","group":"Identification","description":"- Find out whether the company received an extortion demand as a precursor to the attack.\n- Search if anyone would have any interest into threatening your company\n  - Competitors\n  - Ideologically-motivated groups (hacktivists)\n  - Former employees\n- Look for revendications of the attack on Social Medias.\n- Search if anyone would have any interest into threatening your company:\n  - Competitors\n  - Ideologically-motivated groups (hacktivists)\n  - Former employees","status":"Waiting","flag":false,"order":7},{"id":"~123224104","_id":"~123224104","createdBy":"admin@lab.local","createdAt":1748893658232,"_type":"case_task","title":"Stop the Denial of Service condition","group":"Remediation","description":"- Contact your ISP and make sure that it enforces remediation measures. For information, here are some of the possible measures:\n  - Filtering (if possible at level Tier1 or 2) \n  - Traffic-scrubbing/Sinkhole/Clean-pipe \n  - Blackhole Routing\n- If the DDoS sponsors have been identified, consider involving law enforcement. This should be performed upon the direction of your company’s executive and legal teams.\n\n**Technical remediation actions can mostly be enforced by your ISP.**\n\n\n\n**NOTES**:\n\n1. **IF THE ATTACK HAD A MAJOR IMPACT, YOU MAY HAVE TO MAKE AN INCIDENT RESPORTING TO REGULATORS.**\n\n2. **IF THE DDOS SPONSORS HAVE BEEN IDENTIFIED, CONSIDER INVOLVING LAW ENFORCEMENT.**\n\n3. **THIS SHOULD BE PERFORMED UPON THE DIRECTION OF YOUR COMPANY'S EXECUTIVE AND LEGAL TEAMS.**","status":"Waiting","flag":false,"order":9},{"id":"~123228200","_id":"~123228200","createdBy":"admin@lab.local","createdAt":1748893658234,"_type":"case_task","title":"Report","group":"Lessons Learned","description":"An incident report should be written and made available to all applicable actors.\n\nThe following themes should be described:\n- Initial detection\n- Actions and timelines of every important events\n- What went right\n- What went wrong\n- Incident cost\n- Indicators of Compromise","status":"Waiting","flag":false,"order":12},{"id":"~164102176","_id":"~164102176","createdBy":"admin@lab.local","createdAt":1748893658225,"_type":"case_task","title":"Inventory","group":"Preparation","description":"- Create a whitelist of the IP addresses and protocols you must allow if prioritizing traffic during an attack. Don’t forget to include your critical customers, key partners, etc.\n- Document your IT infrastructure details, including business owners, IP addresses and circuit IDs, routing settings (AS, etc); prepare a network topology diagram and an asset inventory.","status":"Waiting","flag":false,"order":1},{"id":"~205053952","_id":"~205053952","createdBy":"admin@lab.local","createdAt":1748893658224,"_type":"case_task","title":"Internet Service Provider support","group":"Preparation","description":"**The “preparation” phase is to be considered as the most important element of a successful DDoS incident response.**\n\n- Contact your ISP to understand the DDoS mitigation services it offers (free and paid) and what process you should follow.\n- If possible, subscribe to a redundant Internet connection.\n- If possible, subscribe to an Anti-DDoS service provider.\n- Establish contacts with your ISP and law enforcement entities. Make sure that you have the possibility to use an out-of-band communication channel (e.g.: phone).\n- Make sure your ISP and DDoS mitigation service have a 24/7 phone support.","status":"Waiting","flag":false,"order":0},{"id":"~205058048","_id":"~205058048","createdBy":"admin@lab.local","createdAt":1748893658228,"_type":"case_task","title":"Communication","group":"Preparation","description":"- Prepare an internal and an external communication template about DDoS incidents.\n- Identify channel where this communication will be posted.\n\n**The “preparation” phase is to be considered as the most important element of a successful DDoS incident response.**","status":"Waiting","flag":false,"order":4},{"id":"~205062144","_id":"~205062144","createdBy":"admin@lab.local","createdAt":1748893658229,"_type":"case_task","title":"Involve internal and external actors","group":"Identification","description":"- Contact your internal teams to learn about their visibility into the attack.\n- Contact your ISP to ask for help. Be specific about the traffic you’d like to control:\n  - Network blocks involved\n  - Source IP addresses\n  - Protocols\n- Notify your company’s executive and legal teams.","status":"Waiting","flag":false,"order":6},{"id":"~205066240","_id":"~205066240","createdBy":"admin@lab.local","createdAt":1748893658231,"_type":"case_task","title":"Mitigate the attack’s effects","group":"Containment","description":"- If the bottleneck is a particular feature of an application, temporarily disable that feature.\n- Attempt to throttle or block DDoS traffic as close to the network’s “cloud” as possible via a router, firewall, load balancer, specialized device, etc.\n- Terminate unwanted connections or processes on servers and routers and tune their TCP/IP settings.\n- If possible, switch to alternate sites or networks using DNS or another mechanism. Blackhole DDoS traffic targeting the original IP addresses.\n- Set up an alternate communication channel between you and your users/customers (e.g.: web server, mail server, voice server, etc.)\n- If possible, route traffic through a traffic-scrubbing service or product via DNS or routing changes (e.g.: sinkhole routing)\n- Configure egress filters to block the traffic your systems may send in response to DDoS traffic (e.g.: backsquatter traffic), to avoid adding unnecessary packets to the network.\n- In case of an extortion attempt, try to buy time with the fraudster. For example, explain that you need more time in order to get management approval.\n\n\n**If the bottleneck is at the ISP’s side, only the ISP can take efficient actions. In that case, work closely with your ISP and make sure you share information efficiently.**","status":"Waiting","flag":false,"order":8}],"status":"Ok","customFields":{},"metrics":{}}