{"_id":"~327912","createdBy":"admin@lab.local","updatedBy":"admin@lab.local","createdAt":1734970100222,"updatedAt":1748893606646,"_type":"caseTemplate","name":"IRM#16 Phishing","displayName":"","titlePrefix":"","description":"Guidelines to handle and respond to phishing targeting collaborators","severity":1,"tags":["veris:action:social:variety=\"Phishing\"","veris:action:social:vector=\"Email\""],"flag":false,"tlp":2,"pap":2,"tasks":[{"id":"~82092208","_id":"~82092208","createdBy":"admin@lab.local","createdAt":1748893606639,"_type":"case_task","title":"Phishing Detection","group":"Identification","description":"- Monitor all your points of contact closely (e-mail, web forms, etc.)\n- Deploy spam traps and try to gather spam from partners/third-parties.\n- Deploy active monitoring of phishing repositories, like AA419 or PhishTank for example.\n- Monitor any specialised mailing-list you can have access to, or any RSS/Twitter feed, which could be reporting phishing cases.\n- Use automated monitoring systems on all of these sources, so that every detection triggers an alarm for instant reaction.\n- Monitor your web logs. Check there is no suspicious referrer bringing people to your website. This is often the case when the phishing websites brings the user to the legitimate website after he’s been cheated.\n\n","status":"Waiting","flag":false,"order":5},{"id":"~123056208","_id":"~123056208","createdBy":"admin@lab.local","createdAt":1748893606635,"_type":"case_task","title":"Internal contacts","group":"Preparation","description":"- Maintain a list of all people involved in domain names registration in the company.\n- Maintain a list of all people accredited to take decisions on cybercrime and eventual actions regarding phishing. If possible, have a contract mentioning you can take decisions.","status":"Waiting","flag":false,"order":1},{"id":"~123060304","_id":"~123060304","createdBy":"admin@lab.local","createdAt":1748893606636,"_type":"case_task","title":"External contacts","group":"Preparation","description":"- Have several ways to be reached in a timely manner (24/7 if possible):\n  - E-Mail address, easy to remember for everyone (ex: security@yourcompany)\n  - Web forms on your company’s website (location of the form is important, no more than 2 clicks away from the main page)\n  - Visible Twitter account\n- Establish and maintain a list of takedown contacts in:\n  - Hosting companies\n  - Registry companies\n  - E-Mail providers\n- Establish and maintain contacts in CERTs worldwide, they will probably always be able to help if needed.","status":"Waiting","flag":false,"order":2},{"id":"~123064400","_id":"~123064400","createdBy":"admin@lab.local","createdAt":1748893606643,"_type":"case_task","title":"Assess the end of the phishing case","group":"Recovery","description":"- Ensure that the fraudulent pages and/or e-mail address are down.\n- Keep monitoring the fraudulent URL. Sometimes a phishing website can reappear some hours later. In case a redirection is used and not taken down, monitor it very closely.\n\n**At the end of a phishing campaign, remove the associated warning page from your website.**","status":"Waiting","flag":false,"order":11},{"id":"~123117792","_id":"~123117792","createdBy":"admin@lab.local","createdAt":1748893606634,"_type":"case_task","title":"Preparation","group":"Preparation","description":"- Create a list of all legitimate domains belonging to your company. This will help analysing the situation, and prevent you from starting a takedown procedure on a forgotten legitimate website.\n- Prepare one web page hosted (or a communication) on your infrastructure, ready to be published anytime, to warn your customers about an ongoing phishing attack. Prepare and test a clear deployment procedure as well.\n- Prepare takedown e-mail forms. You will use them for every phishing case, if possible in several languages. This will speed up things when trying to reach the hosting company etc. during the takedown process.\n- Deploy DKIM, DMARC and SPF to all mail chain.\n- Implement multi-factor authentication mechanisms.\n- Monitor cybersquatted domains and content posted on them. Gather contact and abuse information to be prepared in the case you need to use them.","status":"Waiting","flag":false,"order":0},{"id":"~123121888","_id":"~123121888","createdBy":"admin@lab.local","createdAt":1748893606639,"_type":"case_task","title":"Phishing attack scoping","group":"Identification","description":"- Determine the number of targeted users.\n- Search for exploited compromised accounts and identify related malicious activitites.","status":"Waiting","flag":false,"order":6},{"id":"~123125984","_id":"~123125984","createdBy":"admin@lab.local","createdAt":1748893606640,"_type":"case_task","title":"Involve appropriate parties","group":"Identification","description":"Remember to follow established analysis procedures:\n- Determine:\n  - If it is a credential harvesting comapaign or a malware spreading campaign\n  - If it is a targeted campaign or not\n- Inspect message subject and body.\n- Use sandboxes environment to analyse malicious attachments and extract IoCs.\n- Analyse links, domains and hostnames with threat intelligence services.\n- Check the source code of the phishing website.\n- Investigate email headers ofr interesting artifacts: originated server ans sender information for example.","status":"Waiting","flag":false,"order":7},{"id":"~123130056","_id":"~123130056","createdBy":"admin@lab.local","createdAt":1748893606637,"_type":"case_task","title":"Raise customer awareness","group":"Preparation","description":"Don’t wait for phishing incidents to communicate with your customers. Raise awareness about phishing fraud, explain what phishing is and make sure your customers know you won’t ever ask them for credentials/banking information by e-mail or on the phone.","status":"Waiting","flag":false,"order":3},{"id":"~123130080","_id":"~123130080","createdBy":"admin@lab.local","createdAt":1748893606644,"_type":"case_task","title":"Report","group":"Lessons Learned","description":"A crisis report should be written and made available to all of the actors of the crisis management cell.\n\nThe following themes should be described:\n- Initial cause of the infection\n- Actions and timelines of every important event\n- What went right\n- What went wrong\n- Incident cost\n- Indicators of Compromise","status":"Waiting","flag":false,"order":12},{"id":"~123199528","_id":"~123199528","createdBy":"admin@lab.local","createdAt":1748893606641,"_type":"case_task","title":"Collect evidence","group":"Identification","description":"Make a time-stamped copy of the phishing web pages. Use an efficient tool to do that, like HTTrack for example. Don’t forget to take every page of the phishing scheme, not just the first one if there are several. If needed, take screenshots of the pages.\n\n_If the phishing campaign is distributing a malware, you should refer to IRM#7 Windows Malware Detection_","status":"Waiting","flag":false,"order":8},{"id":"~123203624","_id":"~123203624","createdBy":"admin@lab.local","createdAt":1748893606645,"_type":"case_task","title":"Capitalize","group":"Lessons Learned","description":"- Consider what preparation steps you could have taken to respond to the incident faster or more efficiently.\n- Update your contacts-lists and add notes as to what is the most effective way to contact each involved party.\n- Consider what relationships inside and outside your organization could help you with future incidents.\n- Collaborate with legal teams if a legal action is required.","status":"Waiting","flag":false,"order":13},{"id":"~164069408","_id":"~164069408","createdBy":"admin@lab.local","createdAt":1748893606643,"_type":"case_task","title":"Stop the fraud","group":"Remediation","description":"- In case the fraudulent phishing pages are hosted on a compromised website, try to contact the owner of the website. Explain clearly the fraud to the owner, so that he takes appropriate actions: remove the fraudulent content, and most of all upgrade the security on it, so that the fraudster cannot come back using the same vulnerability.\n- In any case, also contact the hosting company of the website. Send e-mails to the contact addresses of the hosting company (generally there is an abuse@hostingcompany) then try to get someone on the phone, to speed things up.\n- Contact the e-mail hosting company to shut down the fraudulent accounts which receive the stolen credentials or credit card information (Either on an “e-mail only” phishing case or on a usual one, if you managed to get the destination e-mail address).\n- In case there is a redirection (the link contained in the e-mail often goes to a redirecting URL) also take down the redirection by contacting the company responsible for the service.\nIn case you get no answer, or no action is taken, don’t hesitate to call back and send e-mails on a regular basis, every two hours for example.\n- If the takedown is too slow, contact a local CERT in the involved country, which could help taking down the fraud.\n\n\n**If the phishing campaign was targeted, consider contacting law enforcement and regulators. You may consider contacting your local CERT.**","status":"Waiting","flag":false,"order":10},{"id":"~205029376","_id":"~205029376","createdBy":"admin@lab.local","createdAt":1748893606638,"_type":"case_task","title":"Raise business line awareness","group":"Preparation","description":"People in business lines must be aware of phishing problems and consider security as a priority. Therefore, they should apply good practices such as avoid sending links (URL) to customers, and use a signature stating that the company will never ask them for credential/banking information online.\n\n- Run period awareness phishing campaigns.\n- Deploy a technical solution allowing collaborators to easily report email to security teams.\n- Establish specific procedures for attachments and URL analysis.","status":"Waiting","flag":false,"order":4},{"id":"~205033472","_id":"~205033472","createdBy":"admin@lab.local","createdAt":1748893606642,"_type":"case_task","title":"Mitigate the attack’s effects","group":"Containment","description":"- Spread the URL of the attack in case of a phishing website.\nUse every way you have to spread the fraudulent URL on every web browser: use the options of Internet Explorer, Chrome, Safari, Firefox, Netcraft toolbar, Phishing-Initiative, etc.\n\nThis will prevent the users from accessing the website while you work on the remediation phase.\n\n- Spread the fraudulent e-mail content on spam-reporting websites/partners.\n- Communicate with your customers.\n\nDeploy the alert/warning page with information about the current phishing attack.\nIn case you are impacted several times a week, don’t always deploy an alert/warning message but rather a very informative phishing page to raise awareness.\n\n- Check the source-code of the phishing website.\n  - See where the data is exported: either to another web content you cannot access (a PHP script usually), or sent by e-mail to the fraudster.\n  - Watch how the phishing-page is built. Do the graphics come from one of your legitimate website, or are they stored locally?\nIf possible, in case the graphics are taken from one of your own websites, you could change the graphics to display a “PHISHING WEBSITE” logo on the fraudster’s page.","status":"Waiting","flag":false,"order":9}],"status":"Ok","customFields":{},"metrics":{}}