{"_id":"~41234576","createdBy":"admin@lab.local","updatedBy":"admin@lab.local","createdAt":1734970084945,"updatedAt":1748894540395,"_type":"caseTemplate","name":"ITM#11 Information Leakage","displayName":"","titlePrefix":"","description":"Deal with internal information disclosed intentionally","severity":2,"tags":[],"flag":false,"tlp":2,"pap":2,"tasks":[{"id":"~41246872","_id":"~41246872","createdBy":"admin@lab.local","createdAt":1748894540389,"_type":"case_task","title":"Detect the issue","group":"Identification","description":"**Data leak can occur from anywhere. Remember that the cause of the leakage can be an individual employee willingly or unwillingly bypassing security issues, or a compromised computer (i.e., large scale/ransomware).**\n\n**Incident notification process**:\n  - Internal information can be a good source of detection: employee confidence, security team identifying a problem, etc.\n\n**Public monitoring tool**:\n  - A watch on Internet search engines and public database can be very valuable to detect information leakage.\n\n\n**DLP (Data Loss Prevention) tool**:\n  - If there is a DLP tool in the company, it can provide valuable information to incident handlers working on information leakage.","status":"Waiting","flag":false,"order":2},{"id":"~82186328","_id":"~82186328","createdBy":"admin@lab.local","createdAt":1748894540392,"_type":"case_task","title":"Remove the threat","group":"Remediation","description":"- If data has been sent to public servers, ask the owner (or webmaster) to remove the disclosed data. Be sure to adjust your request to the recipients (hacktivism webmaster won’t behave as a press webmaster)\n\n- If it’s not possible to remove the disclosed data, provide a complete analysis to the PR team and the management. Monitor leaked documents spread on websites and social networks (FB, Twitter/X, etc) and Internet user’s comments or reactions.\n\n**Provide the elements to HR team to eventually file a complaint against the insider.**","status":"Waiting","flag":false,"order":6},{"id":"~123138128","_id":"~123138128","createdBy":"admin@lab.local","createdAt":1748894540387,"_type":"case_task","title":"Contacts identification","group":"Preparation","description":"- Identify internal technical contacts (security team, incident response team …)\n- Make sure to have contact points in your public relation team, human resources team and legal department\n- Identify external contacts who might be needed, mainly for investigation purposes (like Law Enforcement for example).\n- Prepare internal and external communication strategy.\n- DPO, CDO, GDPR contacts.","status":"Waiting","flag":false,"order":0},{"id":"~123142224","_id":"~123142224","createdBy":"admin@lab.local","createdAt":1748894540391,"_type":"case_task","title":"Mitigation","group":"Containment","description":"- Notify the management, legal and PR team to make sure they are prepared to deal with a massive or targeted disclosure.\n\n- Depending on the leakage vector, block the access to the disclosure URI, the disclosure server, the disclosure source or the disclosure recipients. This action must be done on all infrastructure points.\n\n- Suspend the logical and physical credentials of the insider if the leakage has been confirmed. Involve HR and legal team before any action.\n\n- Isolate the computing system (desktop, printer) used to disclose data in order to perform a forensic analysis later. This manipulation should be done the hard way: remove the electric plug (and the battery in case of a laptop).","status":"Waiting","flag":false,"order":5},{"id":"~123199712","_id":"~123199712","createdBy":"admin@lab.local","createdAt":1748894540388,"_type":"case_task","title":"Security policy","group":"Preparation","description":"- Make sure that the corporate information value is explained in the rules of the procedure, the IT chart, awareness and training session \n- Make sure all valuable assets are identified as it should be\n- Make sure that security incident escalation process is defined and the actors are clearly defined and identified.","status":"Waiting","flag":false,"order":1},{"id":"~123203808","_id":"~123203808","createdBy":"admin@lab.local","createdAt":1748894540390,"_type":"case_task","title":"Confirm the issue","group":"Identification","description":"**Don’t do anything, without a written request from the concerned CISO/person in charge. Based on your legal team advisory, a written permission from the concerned user might also be handy.**\n\n**E-Mail**:\n- The disclosure source could have sent data using his corporate e-mail address.\n- On the messaging system, look for e-mails sent to or received from a suspect account or with a special subject.\n- On the e-mail client on the desktop of the suspect (if available), use a tool which allows you to search by filtering out the “_PRIVATE)” flagged e-mails. If you really need to do so, ask the user for a written agreement or ask him to be with you.\nWhen applicable, look through related log files.\n- When applicable, look through related log files\n- Use forensic tools to check for deleted browsing history. Also check all the offline content left from all browsing.\n\n**Browsing**:\n- Data might have been sent on webmail/forums/dedicated websites. - On the proxy server, check the logs relating to the suspect account connections on the suspected URL used to disclose data. \n- On the desktop (if available), check the history of the installed browsers. Remember some people might have different\nbrowsers on the same desktop computer; be sure to check every browser history. If the moment of the data leak can be\ntime-stamped, some log files can provide useful information.\n\n**External storage devices**:\n- A various number of devices can be used to store data: USB keys, CD-ROM, DVD, external hard disks, smartphones, memory card ...\n- Little information will be found concerning data transfer using these devices. The USB key used to transfer data can be referenced by the operating system. A forensic analysis can confirm the use of hardware but not the data transmitted.\n\n**Local files**:\n- If nothing has been found yet, there are still chances to find traces in the local file system of the suspect. Just like for e-mail researches, use a parsing tool which forbids any access to the PRIVATE zone of the user. If you really need to do so, act accordingly to local employment law.\n\n**Network transfer**:\n- Multiple ways might be used to transfer data out of the company: FTP, instant messenger, etc. Try to dig into log files\nshowing such activity.\n- Data might also have been sent using a VPN tunnel or on an SSH server. In this case, one can prove the connection by watching log files but can’t see the content transmitted.\n\n**Printer**:\n- Data can be sent to printers connected to the network. In this case, check for traces on the spooler or directly on the printer, since some constructors directly store printed documents on a local hard drive.\n\n**Malware/Ransomware**:\nA malware/ransomware compromise can be at the source of an information leakage and must be treated accordingly with the “Malware Detection” IRM#7 or ”Ransomware” IRM#17\n\n**Note: Even when enough evidence has been found, always look for more. It is not because you proved that data got fraudulently from A to B with one method that it wasn’t also sent to C with another method. Also don’t forget that someone else could have accessed the computer. Was the suspected employee actually in front of his computer when the leak occured?**","status":"Waiting","flag":false,"order":3},{"id":"~123207904","_id":"~123207904","createdBy":"admin@lab.local","createdAt":1748894540393,"_type":"case_task","title":"Restore the system","group":"Recovery","description":"- If a system has been compromised, restore it completely.\n\n- Eventually warn your employees or some local teams about the issue to raise awareness and increase security rules.\n\n- When situation comes back to normal, eventually remove the official communication.","status":"Waiting","flag":false,"order":7},{"id":"~123212000","_id":"~123212000","createdBy":"admin@lab.local","createdAt":1748894540393,"_type":"case_task","title":"Report","group":"Lessons Learned","description":"Inform hierarchy, subsidiaries and partners to share the best practices applied on this incident to enforce similar rules on other locations.\n\n\nAn incident report should be written and made available to all of the actors of the incident.\n\nThe following themes should be described: \n- Initial detection\n- Actions and timelines\n- What went right\n- What went wrong \n- Incident impact\n- Indicators of Compromise","status":"Waiting","flag":false,"order":8},{"id":"~123216096","_id":"~123216096","createdBy":"admin@lab.local","createdAt":1748894540394,"_type":"case_task","title":"Capitalize","group":"Lessons Learned","description":"Actions to improve the information leakage handling processes should be defined to capitalize on this experience.","status":"Waiting","flag":false,"order":9},{"id":"~164147232","_id":"~164147232","createdBy":"admin@lab.local","createdAt":1748894540390,"_type":"case_task","title":"Analyze concerned data (if available)","group":"Identification","description":"Analyze concerned data if available\n- Sometime, leaked data can be downloaded and analyzed by security team. Ransomware shaming list website often publish leaked information.\n- Using data analysis tools like Aleph can help legal teams to decide what actions need to be taken.\n\n**At the end of this phase, you may consider involving law enforcement services and regulators if required.**","status":"Waiting","flag":false,"order":4}],"status":"Ok","customFields":{},"metrics":{}}