{"_id":"~205156352","createdBy":"admin@lab.local","createdAt":1748898603606,"_type":"caseTemplate","name":"IRM#22 Business Email Compromise","displayName":"","titlePrefix":"","description":"Guidelines to handle Business Email Compromise Incidents","severity":2,"tags":[],"flag":false,"tlp":2,"pap":2,"tasks":[{"id":"~41271448","_id":"~41271448","createdBy":"admin@lab.local","createdAt":1748898603608,"_type":"case_task","title":"Automated Monitoring and Detection","group":"Preparation","description":"- Implement automated monitoring across all relevant systems, including email servers, network access logs, and authentication systems, to continuously detect BEC indicators.\n- Make sure that any detection event triggers an immediate notification to the incident response team for rapid investigation and action.\n- Utilize Security Information and Event Management tools to correlate events and identify potential BEC patterns effectively.\n\n**DEFINITION: Business Email Compromise is a type of advanced financial scam in which criminals use compromised email access to trick employees into transferring large amounts of money or sensitive information. BEC incidents can result in significant financial losses and reputational damage.**","status":"Waiting","flag":false,"order":1},{"id":"~41275544","_id":"~41275544","createdBy":"admin@lab.local","createdAt":1748898603618,"_type":"case_task","title":"Involving Appropriate Parties","group":"Identification","description":"- Upon detection of a BEC incident, promptly notify designated company personnel authorized to make critical decisions, such as senior management, IT security leads, and finance executives.\n- Ensure that decisions to act on fraudulent emails or transactions are made swiftly, preferably within minutes, to minimize potential damage.\n- Engage relevant departments, including IT, legal, public relations, and finance, to ensure a coordinated response.\n- If necessary, involve external partners such as email service providers, cybersecurity firms, and law enforcement agencies to support the investigation and mitigation efforts.","status":"Waiting","flag":false,"order":4},{"id":"~41279640","_id":"~41279640","createdBy":"admin@lab.local","createdAt":1748898603628,"_type":"case_task","title":"Block Malicious IPs and Domains","group":"Containment","description":"- Identify and block IP addresses associated with the unauthorized access or malicious activities using firewall rules and email security gateways.\n- Add suspicious domains used in phishing or fraudulent emails to blacklist to prevent further communication from these sources.","status":"Waiting","flag":false,"order":7},{"id":"~82161840","_id":"~82161840","createdBy":"admin@lab.local","createdAt":1748898603631,"_type":"case_task","title":"Segregate Affected Systems","group":"Containment","description":"- Isolate affected systems from the main network to prevent lateral movement by the attackers. This includes segregating email servers, user endpoints, and any connected devices.\n- Implement strict access controls; make sure that only authorized personnel have access to critical systems during the containment process.","status":"Waiting","flag":false,"order":8},{"id":"~82178224","_id":"~82178224","createdBy":"admin@lab.local","createdAt":1748898603705,"_type":"case_task","title":"Restore from Clean Backups","group":"Recovery","description":"- Restore data and systems from backups verified to be free from compromise, ensuring that\nrestored data is accurate and up-to-date.\n- Confirm that all restored systems operate correctly and securely without residual threats.","status":"Waiting","flag":false,"order":31},{"id":"~82219096","_id":"~82219096","createdBy":"admin@lab.local","createdAt":1748898603642,"_type":"case_task","title":"Preserve Evidence for Investigation","group":"Containment","description":"- Make sure that all relevant logs (e.g. email server logs, network traffic logs, authentication logs) are preserved in their original format for analysis and evidence.\n- Create forensic images of compromised systems to aid in detailed investigations without altering the original evidence or tempering with the original hardware.","status":"Waiting","flag":false,"order":12},{"id":"~82231384","_id":"~82231384","createdBy":"admin@lab.local","createdAt":1748898603664,"_type":"case_task","title":"Deploy advanced email security solutions with enhanced capabilities","group":"Remediation (Internal)","description":"- Detecting anomalous login locations and times\n- Identifying suspicious forwarding patterns\n- Flagging unusual sending behavior\n- Quarantining messages with BEC indicators","status":"Waiting","flag":false,"order":19},{"id":"~82251864","_id":"~82251864","createdBy":"admin@lab.local","createdAt":1748898603713,"_type":"case_task","title":"Reporting to Stakeholders","group":"Recovery","description":"- Provide detailed reports to relevant stakeholders on the remediation process and its effectiveness.\n- Fulfil any legal or regulatory reporting requirements related to the BEC incident, ensuring transparency and compliance.","status":"Waiting","flag":false,"order":33},{"id":"~123183184","_id":"~123183184","createdBy":"admin@lab.local","createdAt":1748898603615,"_type":"case_task","title":"Scoping up","group":"Identification","description":"- Identify all email accounts that have been compromised and assess the level of access each account had within the organization.\n- Determine how the BEC incident was executed, whether through phishing, account takeover, or leveraging business logic vulnerabilities.\n- Identify which departments or business units are impacted by the BEC incident.\n- Assess whether the attack originated from a single source or a threat actor group.","status":"Waiting","flag":false,"order":3},{"id":"~123191376","_id":"~123191376","createdBy":"admin@lab.local","createdAt":1748898603651,"_type":"case_task","title":"Update Security Configurations","group":"Containment","description":"- Apply necessary patches and updates to systems and software that may have been exploited during the BEC incident.\n- Adjust the configurations of security tools and systems to better defend against the specific tactics used in the current BEC scheme.\n","status":"Waiting","flag":false,"order":15},{"id":"~123195472","_id":"~123195472","createdBy":"admin@lab.local","createdAt":1748898603654,"_type":"case_task","title":"External","group":"Remediation","description":"**If fraudulent content is associated with the identified scam and is hosted online:**\n- **Identify the Owner, Hosting Provider and Domain Registrar** of the scam site with complete documentation of malicious activity.\n- **Reference the Fraudulent Website via Toolbars for Instant Blocking in Major Web Navigators**. Implement enterprise-wide blocking through security tools rather than relying solely on browser extensions.\n- **Draft a detailed abuse request** clearly explaining the **nature of the identified fraud**, providing specific details and evidence. Include screenshots, email headers, IP addresses, timestamps, and transaction details to expedite effective response from the Registrar/Hosting provider.\n- **Send an abuse request to the Hosting and Registrar company** using the established `abuse@hostingcompany` or `abuse@registrar` email address. Follow up with multiple communication channels including their dedicated security response teams when available.\n- **Follow up with direct phone contact** to the abuse/security teams to expedite the process and establish a clear timeline for resolution.\n- **Report the fraudulent email account to the email hosting company** with a formal request for immediate account freeze or suspension. Preserve email evidence in accordance with your organization's data retention policy for potential legal proceedings.\n- **Submit comprehensive evidence packages** including copies of fraudulent emails with complete headers, timestamps of unauthorized access, and documentation of financial impact.\n- **Investigate and document all social media platforms** being used by the threat actors, including specific accounts, posts, and messaging tactics.\n- **Submit coordinated takedown requests** to all affected social media platforms with your organization's security team contact information for follow-up.\n- Block all email communication to/from the fraudulent account to prevent malicious actions.\n- If no response or action is taken, follow up regularly via email and phone.\n- If the takedown process is laxist or slow, consider contacting a local CERT team of the the involved country. Explain the challenges you have been facing and request their assistance in resolving the issue. Provide applicable evidence.","status":"Waiting","flag":false,"order":16},{"id":"~123203664","_id":"~123203664","createdBy":"admin@lab.local","createdAt":1748898603687,"_type":"case_task","title":"Patch Vulnerabilities","group":"Recovery","description":"- Apply patches and updates to all software, operating systems, and applications to close\nexploited vulnerabilities.\n- Adjust system configurations to adhere to security best practices and minimize exploitable weaknesses.","status":"Waiting","flag":false,"order":26},{"id":"~123211856","_id":"~123211856","createdBy":"admin@lab.local","createdAt":1748898603709,"_type":"case_task","title":"Back to Normal Operations","group":"Recovery","description":"- Test and validate all services and systems to ensure they are functioning as expected after restoration.\n- Gradually reinstate user access to systems, ensuring that all accounts are secure and authorized.","status":"Waiting","flag":false,"order":32},{"id":"~123215952","_id":"~123215952","createdBy":"admin@lab.local","createdAt":1748898603721,"_type":"case_task","title":"Report","group":"Lessons Learned","description":"A crisis report should be written and made available to all of the actors of the crisis management cell.\n\nThe following themes should be described:\n- Initial cause of the infection\n- Actions and timelines of every important event\n- What went right\n- What went wrong\n- Incident cost\n- Indicators of Compromise","status":"Waiting","flag":false,"order":35},{"id":"~123220168","_id":"~123220168","createdBy":"admin@lab.local","createdAt":1748898603717,"_type":"case_task","title":"Communication and Awareness","group":"Recovery","description":"- Develop targeted security awareness training focused on BEC prevention.\n- Implement additional verification procedures for financial transactions and communications.\n- Establish clear communication protocols for future security incidents.\n- Conduct regular phishing simulation exercises focused on BEC scenarios.\n- Provide dedicated training for finance and accounting personnel on fraud detection.","status":"Waiting","flag":false,"order":34},{"id":"~123257056","_id":"~123257056","createdBy":"admin@lab.local","createdAt":1748898603648,"_type":"case_task","title":"Implement Short-Term Mitigations","group":"Containment","description":"- Temporarily reduce the privileges of accounts that are not essential for containment efforts to minimize the risk of further compromise.\n- Reinforce monitoring on critical systems and accounts to detect any suspicious activities during the containment phase.","status":"Waiting","flag":false,"order":14},{"id":"~123269344","_id":"~123269344","createdBy":"admin@lab.local","createdAt":1748898603661,"_type":"case_task","title":"Conduct thorough email environment scanning to improve early BEC incident alerting","group":"Remediation (Internal)","description":"- Unauthorized mail forwarding rules\n- Suspicious inbox rules that automatically move, delete or forward messages\n- Unusual delegate access permissions\n- Evidence of email exfiltration or mass-downloading","status":"Waiting","flag":false,"order":18},{"id":"~123277536","_id":"~123277536","createdBy":"admin@lab.local","createdAt":1748898603691,"_type":"case_task","title":"Enhance Email Security","group":"Recovery","description":"- Implement or upgrade email security solutions with advanced threat protection features such as sandboxing and advanced heuristics\n- Enforce encryption for sensitive email communications to protect data in transit.","status":"Waiting","flag":false,"order":27},{"id":"~123285728","_id":"~123285728","createdBy":"admin@lab.local","createdAt":1748898603698,"_type":"case_task","title":"Network Security Enhancements","group":"Recovery","description":"- Deploy or upgrade applicable security controls (WAF, IDS, IPS, etc.) to monitor and block malicious activities in real-time.\n- Further segment networks to limit access between different organizational units and reduce the attack surface.","status":"Waiting","flag":false,"order":29},{"id":"~123289824","_id":"~123289824","createdBy":"admin@lab.local","createdAt":1748898603702,"_type":"case_task","title":"Data Protection and Backup Strategies","group":"Recovery","description":"- Ensure that regular, secure backups of critical data are conducted and stored offline or in a secure cloud environment.\n- Implement DLP solutions to monitor and protect sensitive data from unauthorized access or exfiltration.","status":"Waiting","flag":false,"order":30},{"id":"~123396136","_id":"~123396136","createdBy":"admin@lab.local","createdAt":1748898603607,"_type":"case_task","title":"Contacts and Procedures","group":"Preparation","description":"- Develop and enforce policies addressing email security, authentication protocols (e.g. SPF,\nDKIM, DMARC), and acceptable use.\n- Integrate BEC scenarios into the broader Incident Response Plans, Playbooks, Procedures outlining roles, responsibilities, and procedures.\n- Prepare a communication plan to warn collaborators, clients or partners about ongoing BEC attacks.\n- Establish and maintain a list of takedown contacts at hosting providers, domain registrars,\nand email service providers.\n- Run periodic awareness campaigns covering BEC, social engineering, scam and phishing\nincidents.\n- Deploy a technical solution allowing collaborators to easily report suspicious emails to security teams or a perimetric security collaborator.\n- Create dedicqted channels, such as email addresses, social media profiles, and phone lines to enable external reporting of suspicious emails, phone calls, fraudulent wires and other signs of BEC incidents.\n- Establish specific procedures for attachments and URL link analysis in a sandboxed or otherwise secured environment inhibiting infection propagation.\n- Maintain a list of contacts involved in financial transactions and wire transfers, including the validators.\n- Implement strict verification procedures for wire transfers and changes in vendor payment information.\n- Establish a cross-functional incident response and/or crisis teams with representatives from IT, security, antifraud, communication, legal, business units (add or exclude in regards to your organization's specific industry and needs).","status":"Waiting","flag":false,"order":0},{"id":"~123408424","_id":"~123408424","createdBy":"admin@lab.local","createdAt":1748898603621,"_type":"case_task","title":"Evidence Collection","group":"Identification","description":"- Gather samples of the fraudulent emails, ensuring that both the email headers and content are preserved for analysis. Analyze collected fraudulent emails to identify patterns, such as recurring sender IP addresses or common malicious links.\n- Make sure that email headers are intact to analyze the origin, routing, and authenticity of the emails.","status":"Waiting","flag":false,"order":5},{"id":"~123420712","_id":"~123420712","createdBy":"admin@lab.local","createdAt":1748898603636,"_type":"case_task","title":"Review and Update Email Security Policies","group":"Containment","description":"- Enhance spam and phishing filters to detect and block malicious emails more effectively based on the indicators identified during the Identification phase.\n- Ensure that email authentication protocols such as SPF, DKIM, and DMARC are correctly put in place and properly configured to prevent email spoofing.\n- Implement stringent monitoring of outbound emails for sensitive information or unusual patterns that may indicate ongoing compromise attempts.\n- Apply temporary restrictions on certain types of email attachments or hyperlinks until the threat is fully contained and mitigated.","status":"Waiting","flag":false,"order":10},{"id":"~123424808","_id":"~123424808","createdBy":"admin@lab.local","createdAt":1748898603639,"_type":"case_task","title":"Communication Management","group":"Containment","description":"- Coordinate with public relations and legal teams to prepare appropriate public statements or notifications to stakeholders, customers, and partners while containing sensitive information.\n- Engage with law enforcement agencies early in the containment phase to assist with their investigation and to follow any guidance they provide.","status":"Waiting","flag":false,"order":11},{"id":"~123428904","_id":"~123428904","createdBy":"admin@lab.local","createdAt":1748898603645,"_type":"case_task","title":"Collaborate with Stakeholders","group":"Containment","description":"- Establish contacts with the associated banking or financial entity regarding the pathways of money flows to enable subsequent legal proceedings.\n- Work closely with IT, security, and other relevant teams to implement containment measures effectively and ensure all aspects of the incident are addressed.\n- Provide regular updates to key stakeholders on the containment status and any emerging issues.\n- Coordinate with email service providers to block malicious emails and secure compromised accounts.\n- Communicate the fraudulent nature of the compromised email campaigns to involved external parties such as partners, clients, financial institutions etc.","status":"Waiting","flag":false,"order":13},{"id":"~123437096","_id":"~123437096","createdBy":"admin@lab.local","createdAt":1748898603668,"_type":"case_task","title":"Implement strict email authentication protocols","group":"Remediation (Internal)","description":"- DMARC aka Domain-based Message Authentication, Reporting & Conformance\n- SPF aka Sender Policy Framework\n• DKIM aka DomainKeys Identified Mail\n- Configure – if deemed acceptable - policies to reject, rather than merely quarantine, failing messages.","status":"Waiting","flag":false,"order":20},{"id":"~123445288","_id":"~123445288","createdBy":"admin@lab.local","createdAt":1748898603674,"_type":"case_task","title":"Deploy transaction monitoring systems for enhanced detection","group":"Remediation (Internal)","description":"- Unusual payment destinations or amounts.\n- Changes to established vendor banking information.\n- Urgent or high-pressure financial requests.\n- Transactions deviating from established patterns.","status":"Waiting","flag":false,"order":22},{"id":"~123449384","_id":"~123449384","createdBy":"admin@lab.local","createdAt":1748898603680,"_type":"case_task","title":"Financial Impact Analysis","group":"Recovery","description":"- Assess the financial impact by determining the extent of the loss.\n- Determine the impact on sensitive information, financial transactions, and operational integrity.\n- Contact relevant financial institutions to report the fraud.\n- Request reversals of any unauthorized transactions if deemed possible.\n- Temporarily put in read only mode the affected accounts to prevent further unauthorized access.","status":"Waiting","flag":false,"order":24},{"id":"~123453480","_id":"~123453480","createdBy":"admin@lab.local","createdAt":1748898603684,"_type":"case_task","title":"Eradication of Threats","group":"Recovery","description":"- Scan and clean all affected systems to eliminate malware, spyware, or other malicious software introduced during the attack.\n- Identify and delete any unauthorized user accounts or services created by the attackers.\n- Remove any backdoors, scripts, or automated processes installed to facilitate ongoing access.","status":"Waiting","flag":false,"order":25},{"id":"~123465768","_id":"~123465768","createdBy":"admin@lab.local","createdAt":1748898603724,"_type":"case_task","title":"Capitalize","group":"Lessons Learned","description":"- Consider what preparation steps you could have taken to respond to the incident faster or more efficiently.\n- Update your contacts-lists and add notes as to what is the most effective way to contact each involved party.\n- Consider what relationships inside and outside your organization could help you with future incidents.\n- Improve DKIM, SPF and DMARC filters.\n- Collaborate with legal teams if a legal action is required","status":"Waiting","flag":false,"order":36},{"id":"~164184096","_id":"~164184096","createdBy":"admin@lab.local","createdAt":1748898603677,"_type":"case_task","title":"Root Cause Analysis","group":"Recovery","description":"- Analyze all details from the Identification and Containment phases to understand how the BEC incident occurred.\n- Determine the specific methods and vectors used by the attackers, such as phishing emails, malware, or compromised credentials.\n- Identify any misconfigurations or security gaps that were exploited during the attack.","status":"Waiting","flag":false,"order":23},{"id":"~205160448","_id":"~205160448","createdBy":"admin@lab.local","createdAt":1748898603612,"_type":"case_task","title":"Identifying BEC Indicators","group":"Identification","description":"- Identify emails requesting wire transfers, sensitive information, or changes to payment details, especially those with urgent tones.\n- Assess the potential impact and severity of the incident based on the nature of the compromise.\n- Determine the extent of the compromised accounts and the breadth of the attack.\n- Opt for using a centralized monitoring systems on all these sources, so that every detection triggers an alarm for instant reaction.\n- Spot emails that convey a sense of urgency, secrecy, or high-stakes scenarios to pressure recipients into quick actions bypassing thorough verification.\n- Notice deviations in the tone, language or formatting of emails from known contacts or executives.\n- Make sure that alerts are delivered instantly to the incident response team and relevant stakeholders to facilitate swift action.\n- Assess the potential financial, reputational, and operational impacts based on the nature and extent of the BEC incident.\n- Define severity levels as per maximum potential impact in terms of financial losses, data compromise, operation disruption to prioritize response efforts and allocate resources effectively","status":"Waiting","flag":false,"order":2},{"id":"~205164544","_id":"~205164544","createdBy":"admin@lab.local","createdAt":1748898603625,"_type":"case_task","title":"Isolate Compromised Accounts","group":"Containment","description":"- Temporarily suspend or disable email accounts identified as compromised to prevent further unauthorized access and malicious activities.\n- Enforce immediate password changes for compromised accounts and any other accounts that may share similar credentials. Check the administrator account’s integrity.\n- Ensure MFA is enabled on all critical accounts to add an extra layer of security.\n- Audit newly created mailbox rules, which may contain redirections to external mailboxes. Remove all rogue rules.","status":"Waiting","flag":false,"order":6},{"id":"~205168640","_id":"~205168640","createdBy":"admin@lab.local","createdAt":1748898603633,"_type":"case_task","title":"Restrict External Communications","group":"Containment","description":"- Temporarily restrict or closely monitor outbound email traffic to detect and block any fraudulent communication.\n- Limit or suspend remote access capabilities for affected accounts and systems until they have been\nsecured and verified as safe.","status":"Waiting","flag":false,"order":9},{"id":"~205172736","_id":"~205172736","createdBy":"admin@lab.local","createdAt":1748898603658,"_type":"case_task","title":"Implement immediate account security measures aka ‘quick wins'","group":"Remediation (Internal)","description":"- Forced password changes for all affected and potentially affected accounts.\n- Deployment of multi-factor authentication for all business email accounts.\n- Review and revocation of suspicious mail forwarding rules.\n- Suspension of legacy email protocols that may bypass MFA requirements.","status":"Waiting","flag":false,"order":17},{"id":"~205176832","_id":"~205176832","createdBy":"admin@lab.local","createdAt":1748898603671,"_type":"case_task","title":"Establish emergency financial safeguards","group":"Remediation (Internal)","description":"- Implement temporary additional verification steps for all financial transactions.\n- Place holds on any pending transactions until verification processes are complete.\n- Implement out-of-band verification for all payment changes and wire transfers.\n- Establish threshold-based approval workflows requiring multiple authenticators.","status":"Waiting","flag":false,"order":21},{"id":"~205185024","_id":"~205185024","createdBy":"admin@lab.local","createdAt":1748898603694,"_type":"case_task","title":"Implement Advanced Authentication Measures","group":"Recovery","description":"- Expand MFA implementation across all user accounts, especially those with access to critical systems.\n- Enforce strong password policies, including complexity requirements and regular password changes.","status":"Waiting","flag":false,"order":28}],"status":"Ok","customFields":{},"metrics":{}}