{"_id":"~123080904","createdBy":"admin@lab.local","updatedBy":"admin@lab.local","createdAt":1748892779990,"updatedAt":1748893747263,"_type":"caseTemplate","name":"IRM#20 Red Team Detection","displayName":"","titlePrefix":"","description":"Guidelines to Detect and Respond to Red-teaming Activities","severity":2,"tags":[],"flag":false,"tlp":2,"pap":2,"tasks":[{"id":"~41210008","_id":"~41210008","createdBy":"admin@lab.local","createdAt":1748893747259,"_type":"case_task","title":"Remove Red Team Accesses","group":"Remediation","description":"- Comprehensively **review the findings** from the previous phases. Ascertain the Red team’s initial access points, footholds on systems, lateral activities, persistency mechanisms are well scoped up.\n- Make sure the vulnerabilities exploited by the Red Team and other applicable **attack methods are well understood**.\n- Once all tactics, methods and vulnerabilities are identified, **prioritize TTPs based on their potential security impacts**.  _Begin patching with the highest-risk vulnerabilities, working down to the less critical ones._\n- Based on the findings, **harden system configurations** to prevent future exploitations. This can involve measures like tightening security settings, limiting user privileges, disabling unnecessary services, and refining firewall rules. This is also applicable to the lessons learned phase.\n- Locate and remove any persistence mechanisms, backdoors or webshells the Red Team may have left on your systems during the exercise. Perform a thorough investigation to make sure no derivative vulnerabilities or backdoor paths remain.\n- Conduct validation tests to confirm that the remediation actions have effectively secured the compromised systems. Double check that the Red Team or any other offensive entity can no longer exploit earlier identified vulnerabilities.\n- Duly document all remediation steps, their outcomes, and any challenges encountered during the process. Transmit summaries of remediation fixes and workarounds to relevant stakeholders,\nincluding the descriptions of how these vulnerabilities were exploited by the Red Team. **This step also applies to the Lessons Learned phase.**","status":"Waiting","flag":false,"order":4},{"id":"~82124976","_id":"~82124976","createdBy":"admin@lab.local","createdAt":1748893747262,"_type":"case_task","title":"Capitalize","group":"Lessons Learned","description":"- Document the exercise’s findings, including attack methods, vulnerabilities, and impact – this vetted knowledge may assist in future incident response missions.\n- Assess the effectiveness of the detection and response controls.\n- Identify areas for improvement and implement changes to processes and defenses.\n- Share knowledge gained from the exercise with relevant stakeholders.\n- Conduct a debriefing meeting with all involved parties. The Red Team should present their methodology, tactics, techniques, and procedures, and explain how they exploited system vulnerabilities.\n- Perform a detailed analysis of the entire incident response operation, from detection to recovery. Identify what worked well, what didn't, and where there are opportunities for improvement.\n- Document the insights gained from the exercise, detailing the challenges faced and their solutions. Compile a list of items that require further remediation actions, specifying who should be responsible for implementing these changes.\n- Based on the lessons learned, develop a comprehensive action plan to address identified gaps. Prioritize activities based on their importance and urgency to make sure the highest risks are dealt with promptly (quick wins).\n- Dedicate a person to follow up on the advancement of these implementations. This action could be handed over to the Purple Team.\n- Communicated the findings and lessons learned to a broader spectrum of stakeholders. This could extend to the entire organization to enhance overall security awareness and behavior.\n- Plan for a mid to long-term follow-up audit to verify the effective implementation of the action plan items derived from the Red Team mission findings.\n\n**A Redteam exercise may be considered as a pre-phase for a continuous improvement project such as Purple Team.**","status":"Waiting","flag":false,"order":7},{"id":"~123166944","_id":"~123166944","createdBy":"admin@lab.local","createdAt":1748893747257,"_type":"case_task","title":"Detection","group":"Identification","description":"- Monitor for signs of compromise and unusual behavior in your environment (lateral movement, persistence mechanisms, etc.).\n- Investigate security alerts and analyze logs for indicators of potential Red Team activity.\n- Triage potential incidents to determine whether they may be part of a Red Team exercise.\n- Evaluate the extent and potential consequences of the identified Red Team activity. Ask the White team in case of a doubt to avoid mistreating an incident generated by a real threat actor.\n- Once the incident is validated, scope up which systems are affected, which data may have been exposed or exfiltrated, and what potential overall impact can this incident generate on business operations. Providing adequate answers may require envisioning the final objectives pursued by the Red Team.\n- Involve all previously identified stakeholders including but not limited to Blue teams, business, infrastructure support, general Information security staff; evaluate potential impact based on available information on the incident and feedback received from business and IT counterparts.\n- Evaluate possible remediation scenarios such as blocking interconnections, reinforcing monitoring based on the risk assessment vs. potential impacts on production. Be extremely cautious as to not reveal to the Red teamers they may have been identified.\n- If validation and scoping-up affirm a known Red Team incident, escalate it to higher management. Provide them with all necessary details accurately and promptly.\n- Have White team coordinators establish communication channels with applicable stakeholders to continuously share information about the ongoing exercise. If required by the incident’s nature, set up dedicated alternative (non-corporate) channels to use for communication and data exchange during the exercise.\n\n\n**Consider consulting other IRMs which may be applicable to the suspected Red Team mission:**\n- **IRM-2-Windows Intrusion**\n- **IRM-3-Unix Linux Intrusion Detection**\n- **IRM-7-Windows Malware Detection**\n- **IRM-10 Social Engineering**\n- **IRM-11-Information Leakage**\n- **IRM-14 Scam**\n- **IRM-16 Phishing**\n- **IRM-17 Ransomware**\n- **IRM-18 Large Scale Compromise**","status":"Waiting","flag":false,"order":1},{"id":"~123179208","_id":"~123179208","createdBy":"admin@lab.local","createdAt":1748893747258,"_type":"case_task","title":"Prevent Further Attack Development and Limit Its Scope","group":"Containment","description":"- Isolate all compromised machines or affected systems to prevent further intrusion or attack propagation.\n- Implement access controls and network segmentation to limit the scope of the attack.\n- Set up regular meetings with the affected provider, onboarding applicable stakeholders.\n- Coordinate with the impacted business stakeholders to implement containment measures, such as isolating compromised systems, blocking malicious IOCs, or changing credentials – in line with business safety requirements.\n- Simulate risky or potentially impactful counter-measures to avoid production losses.\n\n**If business-critical traffic cannot be disconnected, allow it after putting in place additional security controls to timely detect and inhibit lateral propagation.**","status":"Waiting","flag":false,"order":2},{"id":"~123289640","_id":"~123289640","createdBy":"admin@lab.local","createdAt":1748893747259,"_type":"case_task","title":"Deploy \"Red\"-IoCs","group":"Containment","description":"If applicable to the identified ‘Red’ IOCs (double check prior to applying as it may trigger nefarious reactions from the Red teamers):\n- Block traffic to identified C2s.\n- Block access to / from any applicable red infrastructure elements.\n- Disable or restrict accounts compromised by the attackers.\n- Send undetected samples to your endpoint security provider, AV vendors and sandbox platforms.\n- Send uncategorized malicious URLs, domain names and IPs to your security providers.","status":"Waiting","flag":false,"order":3},{"id":"~123293736","_id":"~123293736","createdBy":"admin@lab.local","createdAt":1748893747260,"_type":"case_task","title":"Restore Normal Operations","group":"Recovery","description":"All the following steps shall be made in a step-by-step manner and with technical monitoring from Blue, Red, White or Purple teams.\n- Confirm the effectiveness of used remediation strategies. Double-check that vulnerabilities have been patched, system configurations hardened, and persistence mechanisms removed. The systems should be secure before restoring regular operations.\n- Restore systems and services to their normal operational state. In some cases, this might involve additional steps such as rebuilding/remastering systems, restoring data from backups, or migrating to completely new platforms, depending on the extent of the Red Team attack.\n- Once systems are effectively restored, conduct thorough functional and security tests to ensure your systems are working optimally and are not vulnerable to similar types of Red Team activities in the future. Work with the affected business owners to restore all affected services or systems, ensuring that they are secure and free from vulnerabilities.\n- Monitor your systems' performance to detect any anomalies or potential security issues as a part of the Recovery phase. Make sure the systems are operating normally and have retained their\nperformance levels prior to the Red Team exercise.\n- Declare the end of the recovery phase only when you have confirmed that your systems are back to normal, secure and stable. Any anomalies or impact from the Red Team exercise should have been fully addressed.\n\n**Triple-check that the vulnerabilities have been patched, system configurations hardened, and persistence mechanisms removed. The system should be secure before restoring regular operations.**","status":"Waiting","flag":false,"order":5},{"id":"~164114464","_id":"~164114464","createdBy":"admin@lab.local","createdAt":1748893747261,"_type":"case_task","title":"Report","group":"Lessons Learned","description":"A Red Team mission report should be written and made available to all the involved stakeholders. Different formats of the report may be required to present to different audiences at different strategical, operational and tactical levels.\n\nThe following topics should be addressed:\n- Initial cause of the compromise\n- Actions and timelines of every important event\n- What went right\n- What went wrong\n- TTPs\n- Indicators of Compromise","status":"Waiting","flag":false,"order":6},{"id":"~205099008","_id":"~205099008","createdBy":"admin@lab.local","createdAt":1748893747255,"_type":"case_task","title":"Preparation","group":"Preparation","description":"- Develop communication channels to inform stakeholders about detected Red Team exercises; keep in mind the potential existence of overlapping memberships in Blue and White teams to avoid conflict of interest.\n- Identify the potentially existing White team members and establish contact points with them.\n- Use network-based and host-based intrusion detection systems. Ensure these are configured correctly to effectively monitor network traffic and endpoint systems for malicious activities. Make sure secure logging and monitoring of network and system activities is in place, that the events are logged correctly, transmitted to SIEM and that applicable and tested rules exist to levy alerts.\n- Configure and regularly test SIEM tools at your disposal to collect, analyze, and react to security events. These tools can be calibrated to detect indications of Red Team activities, such as login failures, configuration changes, and network reconnaissance attempts.\n- Make sure your existing endpoint protection solutions provide adequate controls against malware through static and dynamic detection. Ensure all types of endpoints and servers are covered, including different desktop and server OS, mobile devices and BYODs (if applicable).\n- Define specific 24/7 contact points and people to intervene in case of an emergency.\n- Establish well-working operational bridges between existing Blue teams (SOC, CERT, other security counterparts); regularly conduct joint incident response exercises onboarding members from different Blue teams.\n- Regularly review and assess your organization’s security controls, policies, and procedures.\n- Implement a “Red Button” procedural control to halt or temporarily put on stop all redteaming activities in case of an operational need (concurring real incident, impact on production etc.).\n- Prepare internal and external communication strategies, procedures, and tools to use during a Red Team incident, including alternative communication channels to exclude information leakage in between Blue and Red team members.\n- Provide Blue team staff with an up-to-date understanding of cyber threats, the Red team's role, and methods they might use. This includes previous attack patterns, commonly employed TTPs and previously seen IOCs. Provide access to previously conducted Red Team mission reports and lessons learned if deemed possible.\n- Make sure to prepare formal paperwork for the mission, including all applicable documents such as Rules of Engagement, Mission Objectives, Detailed Scenario description, Getting-out-of-Jail card, and any additional documentation of sponsorship from key stakeholders, such as CISO, CTO, etc.\n\n**Be prepared to notify C-level stakeholders if required during a Red Team incident.**","status":"Waiting","flag":false,"order":0}],"status":"Ok","customFields":{},"metrics":{}}